In [160]:
import numpy as np
import pandas as pd

In [165]:
salaryTable = {
    "Name" : [ "Hans", "Anna", "John", "Mohammed"],
    "Job" : ["Computer Engineer", "Fashion designer", "Jeweller ", "Cook"],
    "Salary($)" : [5000, 4500,10000,3500]
}

In [166]:
salaryDf = pd.DataFrame(salaryTable)
salaryDf

       Name                Job  Salary($)
0      Hans  Computer Engineer       5000
1      Anna   Fashion designer       4500
2      John          Jeweller       10000
3  Mohammed               Cook       3500

In [167]:
## get uniques
salaryDf["Job"].unique()

array(['Computer Engineer', 'Fashion designer', 'Jeweller ', 'Cook'],
      dtype=object)

In [168]:
salaryDf["Job"].nunique()

4

In [169]:
salaryDf["Job"].value_counts()

Fashion designer     1
Jeweller             1
Cook                 1
Computer Engineer    1
Name: Job, dtype: int64

In [172]:
def netSalary(salary):
    return salary * 0.67

In [173]:
salaryDf["Salary($)"].apply(netSalary)

0    3350.0
1    3015.0
2    6700.0
3    2345.0
Name: Salary($), dtype: float64

In [174]:
salaryDf.isnull()

    Name    Job  Salary($)
0  False  False      False
1  False  False      False
2  False  False      False
3  False  False      False